In [2]:
import pandas as pd

In [3]:
s = pd.Series(['banana', 42]) # making a series

In [4]:
print(s)

0    banana
1        42
dtype: object

In [5]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], # creating index manually
index=['Person', 'Who'])

In [6]:
print(s)

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [7]:
scientists = pd.DataFrame({
    'Name' : ['Rosaline Franklin' , 'William' ] ,
    'Occupation' : ['Chemist' , 'Statistician' ] ,
    'Born' : ['1920-07-25' , '1876-06-13' ] ,
    'Died' : ['1958-04-16' , '1937-10-16'] ,
    'Age' : [37, 61]})
print(scientists)

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1            William  Statistician  1876-06-13  1937-10-16   61

In [9]:
scientists = pd.DataFrame(
data={'Occupation': ['Chemist', 'Statistician'],
'Born': ['1920-07-25', '1876-06-13'],
'Died': ['1958-04-16', '1937-10-16'],
'Age': [37, 61]},
index=['Rosaline Franklin', 'William Gosset'],
columns=['Occupation', 'Born', 'Died', 'Age'])
(scientists)

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [10]:
first_row = scientists.loc['William Gosset']

In [11]:
first_row

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

In [12]:
print(first_row.index)

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [13]:
print(first_row.values)

['Statistician' '1876-06-13' '1937-10-16' 61]

In [14]:
print(first_row.keys())

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [15]:
print(first_row.index[0])

Occupation

In [16]:
print(first_row.keys()[0])

Occupation

In [17]:
ages = scientists['Age']

In [18]:
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [19]:
scientists1 = pd.read_csv ('/Users/deepjeetdatta/Desktop/data/scientists.csv')

In [20]:
scientists1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [21]:
ages = scientists1['Age']

In [23]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [24]:
print(ages.describe())

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [25]:
print(ages.mean())

59.125

In [26]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [27]:
ages[(ages > ages.mean()) & (ages > 75)]

2    90
7    77
Name: Age, dtype: int64

In [28]:
ages[ages > ages.mean() & ages > 75]

TypeError: Cannot perform 'rand_' with a dtyped [int64] array and scalar of type [bool]

In [29]:
ages[(ages > ages.mean()) & ~(ages > 75)]

1    61
3    66
Name: Age, dtype: int64

In [30]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [31]:
scientists1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [32]:
scientists1[scientists1['Age'] > scientists1['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [34]:
scientists1['Age'] > scientists1['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [35]:
scientists1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [40]:
born_datetime = pd.to_datetime(scientists1['Born'], format='%Y-%m-%d')

In [41]:
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [42]:
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [43]:
scientists1['born_dt'] = born_datetime

In [46]:
scientists1['born_dt'] = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')

In [47]:
scientists1

,Name,Born,Died,Age,Occupation,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,NaT
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,NaT
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,NaT
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,NaT
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,NaT
5,John Snow,1813-03-15,1858-06-16,45,Physician,NaT
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,NaT
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,NaT

In [48]:
scientists1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   born_dt     0 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 512.0+ bytes

In [49]:
scientists1['died_dt'] = pd.to_datetime(scientists1['Died'], format='%Y-%m-%d')
scientists1

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,NaT,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,NaT,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,NaT,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,NaT,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,NaT,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,NaT,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,NaT,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,NaT,1855-02-23

In [51]:
scientists= scientists1.drop(['Born', 'Died'], axis=1)

In [52]:
scientists

                   Name  Age          Occupation born_dt    died_dt
0     Rosaline Franklin   37             Chemist     NaT 1958-04-16
1        William Gosset   61        Statistician     NaT 1937-10-16
2  Florence Nightingale   90               Nurse     NaT 1910-08-13
3           Marie Curie   66             Chemist     NaT 1934-07-04
4         Rachel Carson   56           Biologist     NaT 1964-04-14
5             John Snow   45           Physician     NaT 1858-06-16
6           Alan Turing   41  Computer Scientist     NaT 1954-06-07
7          Johann Gauss   77       Mathematician     NaT 1855-02-23